{
  "backend/main.mo": "Defines core types for restaurants, menu items, orders, and comparison utilities, and integrates storage, authorization, and migration logic in the main actor.",
  "backend/migration.mo": "Migrates old live orders to a new format by adding location fields and setting last update timestamps.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of major frontend files describing their roles and behaviors.",
  "frontend/index.css": "Defines Tailwind base layers and OKLCH color variables for light and dark themes across the UI.",
  "frontend/index.html": "HTML entry point loading the root React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app managing routing, authentication, theming, and showing pages like home, cart, orders, and admin.",
  "frontend/src/components/Footer.tsx": "Footer showing restaurant contact info, social links, and branding using fetched restaurant data.",
  "frontend/src/components/Header.tsx": "Header with navigation, cart count, authentication controls, admin checks, and mobile menu support.",
  "frontend/src/components/LiveOrdersView.tsx": "Displays and updates live orders for admins, including status changes, new‑order detection, and rendering order details with menu item lookup.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for collecting and saving a user's profile with form inputs and a save mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login and clear actions.",
  "frontend/src/hooks/useLiveLocationSharing.ts": "Tracks and uploads the user's live geolocation for an order, handling permissions, errors, and periodic updates.",
  "frontend/src/hooks/useQueries.ts": "React‑query hooks wrapping backend calls for profiles, restaurant data, menu items, cart, orders, and mutations with toast feedback.",
  "frontend/src/index.css": "Tailwind base and theme variable definitions for light and dark modes, setting color and layout primitives.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard for managing menu items, orders, and image uploads with various dialogs and actions.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items, manages customer details, and handles order placement.",
  "frontend/src/pages/HomePage.tsx": "Shows restaurant menu with search, filtering, and add‑to‑cart functionality, ensuring required items are included.",
  "frontend/src/pages/OrdersPage.tsx": "Lists user orders, tracks active orders, and manages live location sharing status.",
  "frontend/src/pages/RestaurantPage.tsx": "Empty placeholder page.",
  "frontend/src/utils/menuItemImage.ts": "Utility functions for validating images, converting to bytes, and creating or revoking preview URLs.",
  "frontend/src/utils/requiredMenuItems.ts": "Ensures required menu items are present by merging defaults with fetched items.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL or session‑stored parameters.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with dark mode, content paths, custom OKLCH-based color tokens, extended themes, animations, and typography/container-query/animate plugins.",
  "project_state.json": "Defines project metadata and a detailed feature list for the food delivery platform, outlining authentication, actor lifecycle, admin bootstrap, RBAC, and typed frontend API hooks."
}