{
  "backend/main.mo": "Motoko backend actor defining core domain types (CuisineType, Restaurant, MenuItem, Order, OrderStatus) with comparison helpers, storage integration, authorization mixins, and order/menu management logic for a food delivery platform.",
  "feature_evidence.json": "Feature evidence report documenting the addition of a Chicken Manchuria food photo asset and its display on the home page, including related components, test IDs, and confidence level.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend React components, pages, hooks, styles, and utilities in the application.",
  "frontend/index.css": "Global Tailwind CSS setup defining light and dark theme variables using OKLCH color values and base styling for the entire frontend.",
  "frontend/index.html": "HTML entry point for the frontend app that sets metadata, page title, and mounts the React application at the root element.",
  "frontend/src/App.tsx": "Root React component managing theme, authentication state, page navigation (home, cart, orders, admin), and conditional profile setup modal display.",
  "frontend/src/components/Footer.tsx": "Footer component showing branding, restaurant contact details fetched from the backend, social media icons, and attribution.",
  "frontend/src/components/Header.tsx": "Sticky header with logo, navigation buttons, cart indicator, and authentication controls, including admin-only navigation based on role checks.",
  "frontend/src/components/LiveOrdersView.tsx": "Admin-only real-time order management view with polling, status updates, cancel actions, order notifications, and detailed order display.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that forces new users to complete their food court profile (name, email, phone, address) and saves it via a mutation hook before allowing further use.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches a backend actor based on the current Internet Identity, initializing admin access if a secret token is present and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a context and hook for managing Internet Identity authentication, including login, logout, persisted identities, and detailed login status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines a collection of React Query hooks for interacting with backend data such as user profiles, restaurants, menu items, cart, and orders, handling caching, mutations, and toast notifications.",
  "frontend/src/index.css": "Tailwind CSS base stylesheet defining design tokens, color variables for light and dark themes, and global styles applied across the application.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app and wraps it with React Query and Internet Identity providers, and loads global styles.",
  "frontend/src/pages/AdminDashboard.tsx": "An admin interface for managing menu items and orders, including adding/deleting menu items, updating order statuses, viewing live orders, and gating access based on admin privileges.",
  "frontend/src/pages/CartPage.tsx": "Implements the shopping cart page: fetches cart items, user profile, menu and restaurant data, allows item removal, collects delivery details, calculates totals, and places orders with navigation on success.",
  "frontend/src/pages/HomePage.tsx": "Renders the main menu browsing page with search and category filters, groups menu items, ensures required items exist, displays images, and allows authenticated users to add items to the cart.",
  "frontend/src/pages/OrdersPage.tsx": "Displays the user’s past orders sorted by date, showing restaurant info, total price, items count, and order status with icons and colors.",
  "frontend/src/pages/RestaurantPage.tsx": "Empty or placeholder file with no implemented logic or exports.",
  "frontend/src/utils/requiredMenuItems.ts": "Defines required menu items that must always appear and provides a helper to merge them into fetched menu data if missing.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters (including hash routing), persist them in sessionStorage, retrieve or clear them, and manage sensitive params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, dark mode, container settings, extended color palette, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the overall project state, schema version, and a high-level summary of the SNR Food Court Internet Computer app, including its Motoko backend, React/TypeScript frontend, and admin bootstrap mechanism. It also enumerates existing implemented features with IDs, descriptions, and versions to support build planning and tracking."
}