{
  "backend/main.mo": "Defines core actor types and comparison functions for restaurants, menu items, orders, and cuisine types, integrating storage and authorization mixins.",
  "backend/migration.mo": "Provides type definitions mirroring the main backend structures and a no-op migration that returns the old state unchanged.",
  "feature_evidence.json": "Describes feature evidence linking admin UI changes to specific frontend files and components, with metadata and test references.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files including components, pages, hooks, styles, and utilities.",
  "frontend/index.css": "Defines Tailwind base variables and dark mode theming using OKLCH color values for global styling.",
  "frontend/index.html": "HTML entry point setting up the root container and loading the main React TypeScript module.",
  "frontend/src/App.tsx": "Main React component handling routing between pages, theme setup, authentication state, and profile setup modal.",
  "frontend/src/components/Footer.tsx": "Footer component showing restaurant contact info, social icons, and attribution, pulling data via a restaurant query.",
  "frontend/src/components/Header.tsx": "Header with navigation, auth handling, admin access checks, cart count, and mobile drawer menu.",
  "frontend/src/components/LiveOrderDetailsModal.tsx": "Displays a modal with detailed order info, including status, timestamps, items, and live map location.",
  "frontend/src/components/LiveOrdersView.tsx": "Shows all active orders with admin actions, polling updates, notifications, and a selectable details modal.",
  "frontend/src/components/OrderLocationMap.tsx": "Embeds an OpenStreetMap iframe that updates whenever provided coordinates change.",
  "frontend/src/components/ProfileSetupModal.tsx": "Provides a modal form for users to enter and save their profile information.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the user’s identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and hooks for Internet Identity authentication, login flow, and identity persistence.",
  "frontend/src/hooks/useLiveLocationSharing.ts": "Handles continuous geolocation tracking and pushes live location updates to an order when enabled.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, restaurants, menu items, cart items, and orders.",
  "frontend/src/index.css": "Tailwind CSS configuration defining theme variables and global styles for light and dark modes.",
  "frontend/src/main.tsx": "App entry point that initializes React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin interface for managing menu items and orders, including image uploads, status updates, and live orders.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart, allows editing customer details, removing items, and placing orders.",
  "frontend/src/pages/HomePage.tsx": "Displays restaurant menu with search, category filtering, and add‑to‑cart functionality using local and backend images.",
  "frontend/src/pages/OrdersPage.tsx": "Shows user order history, status indicators, and manages live location sharing for active orders.",
  "frontend/src/pages/RestaurantPage.tsx": "Empty placeholder file for a restaurant page.",
  "frontend/src/utils/externalMaps.ts": "Utility functions generating Google Maps and OpenStreetMap URLs for given coordinates.",
  "frontend/src/utils/menuItemImage.ts": "Provides image validation, file-to-bytes conversion, and preview URL utilities for menu item images.",
  "frontend/src/utils/requiredMenuItems.ts": "Defines required menu items and ensures they are present by merging them into fetched menu items.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, containers, and enabling plugins.",
  "project_state.json": "Describes project state, feature requirements, and pending requests related to order rejection behavior in the admin UI."
}