{
  "backend/main.mo": "Defines data types and comparison utilities for cuisines, restaurants, menu items, and orders within a Motoko actor.",
  "feature_evidence.json": "Lists feature evidence records linking UI removal features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend source files for reference.",
  "frontend/index.css": "Tailwind base stylesheet defining color variables, theming, and global styles for light and dark modes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Main React component handling routing, authentication state, profile setup, and page layout.",
  "frontend/src/components/Footer.tsx": "Footer displaying restaurant contact info, social links, and attribution.",
  "frontend/src/components/Header.tsx": "Header with navigation, authentication controls, cart count, and admin verification error handling.",
  "frontend/src/components/LiveOrdersView.tsx": "Displays and manages active orders with status updates, admin-only notifications for new orders, and menu item lookups.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for collecting and saving a user's profile with form validation and submission.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profile, menu items, restaurant data, carts, and orders using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and applying global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard for managing menu items and updating order statuses with dialogs and grouped listings.",
  "frontend/src/pages/CartPage.tsx": "Cart page showing items, user details, and order placement with editable customer info.",
  "frontend/src/pages/HomePage.tsx": "Home page listing menu items with search, filters, images, and add‑to‑cart support.",
  "frontend/src/pages/OrdersPage.tsx": "User orders page displaying sorted orders with status badges and pricing.",
  "frontend/src/pages/RestaurantPage.tsx": "Placeholder restaurant page with no implemented content.",
  "frontend/src/utils/requiredMenuItems.ts": "Ensures mandatory menu items are included by merging required and fetched items.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining content paths, theme extensions for colors, layout, animations, and enabling typography, container query, and animation plugins.",
  "project_state.json": "Project metadata describing the food delivery app’s overall architecture, features, backend–frontend integration, and versions of existing functionality."
}