{
  "backend/main.mo": "Defines core types for restaurants, menu items, orders, and comparison helpers for sorting.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all major frontend components and utilities.",
  "frontend/index.css": "Tailwind base setup with custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry file mounting the app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling navigation, theme, authentication, and profile setup gating.",
  "frontend/src/components/Footer.tsx": "Footer showing restaurant contact info, social links, and attribution.",
  "frontend/src/components/Header.tsx": "Header with navigation, cart count, auth controls, and admin link with mobile menu.",
  "frontend/src/components/LiveOrdersView.tsx": "Admin-only live order monitor with polling, status updates, new‑order toasts, and cancellation workflow.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form allowing users to enter and save basic profile fields using a saveProfile mutation.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for loading and mutating user profiles, restaurants, menu items, carts, and orders via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for light and dark theme color tokens.",
  "frontend/src/main.tsx": "App entry that initializes React, query client, and InternetIdentityProvider before rendering the app.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard enabling menu item management, order status updates, and restaurant data viewing with dialogs and UI controls.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart, loads cart data, user profile, and menu items, and allows item removal and order placement.",
  "frontend/src/pages/HomePage.tsx": "Displays menu items with search, category filtering, and add-to-cart functionality, ensuring required items are included.",
  "frontend/src/pages/OrdersPage.tsx": "Shows a list of the user's past orders with status indicators and total price, sorted by timestamp.",
  "frontend/src/pages/RestaurantPage.tsx": "Empty placeholder page file.",
  "frontend/src/utils/requiredMenuItems.ts": "Ensures certain mandatory menu items are present by merging defaults with backend-fetched items.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, clearing, and persisting URL parameters using both query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, containers, animations, and enabling plugins.",
  "project_state.json": "Describes the project’s schema version, high-level platform summary, and a list of implemented features covering authentication, actor creation, admin bootstrap, URL-secret handling, React Query hooks, and restaurant/menu/order functionality."
}