{
  "kind": "build_request",
  "title": "Add/Update Chicken Manchuria menu item to ₹159 with food photo",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-3",
      "text": "Update the existing backend menu item with uuid \"chicken-manchuria\" so that it appears in the menu as \"Chicken Manchuria\" priced at ₹159 (price = 159). Ensure the item remains available and continues to belong to the single restaurant \"snr-food-court\".",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "add  chicken manchuria in menu with cost 159 with food photoes"
        ]
      },
      "acceptanceCriteria": [
        "Calling getAllMenuItems returns an item with uuid \"chicken-manchuria\" and price 159.",
        "The item is returned with restaurantUuid \"snr-food-court\" and isAvailable = true."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a food photo asset for Chicken Manchuria at frontend/public/assets/generated/chicken-manchuria.dim_300x300.jpg and ensure the Home page menu card for uuid \"chicken-manchuria\" displays that image via the existing menuItemImageMap.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "with food photoes"
        ]
      },
      "acceptanceCriteria": [
        "The file frontend/public/assets/generated/chicken-manchuria.dim_300x300.jpg exists in the build output.",
        "On the Home page, the menu item with uuid \"chicken-manchuria\" renders using /assets/generated/chicken-manchuria.dim_300x300.jpg (not a fallback image)."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture (all Motoko logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui (compose them only).",
    "Do not edit frontend immutable hook paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "Do not add new payment methods or modify checkout flow.",
    "Do not add a new admin password gate or change admin authorization behavior.",
    "Do not introduce multi-photo galleries; a single representative photo is sufficient."
  ],
  "imageRequirements": {
    "required": [
      "Close-up plated Chicken Manchuria Indo-Chinese dish photo, glossy sauce, garnished with spring onions, warm restaurant lighting (chicken-manchuria.dim_300x300.jpg)"
    ],
    "edits": []
  }
}