{
  "kind": "build_request",
  "title": "Remove restaurant-rejected orders from admin UI and permanently delete admin-rejected orders",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "When an admin rejects an order, permanently delete the order from backend state so it no longer appears in any admin queries.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-1"
        ],
        "quotes": [
          "rejected orders are permanently deleted and immediately removed from the admin dashboard"
        ]
      },
      "acceptanceCriteria": [
        "Calling backend rejectOrder(orderId) removes the order from the orders map (getAllOrders no longer returns it).",
        "Calling backend rejectOrder(orderId) removes the order from liveOrders (getAllActiveOrders no longer returns it).",
        "Any related tracking state for the order (e.g., orderStatusTracking) is cleared/removed so no stale entries remain.",
        "rejectOrder(orderId) continues to enforce admin-only authorization."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure admin live orders endpoints do not return rejected orders, so that if an order’s status becomes #rejected (e.g., via restaurant rejection workflow), it is removed from the admin live orders view.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-2"
        ],
        "quotes": [
          "when the restaurant rejects the order, it should be removed only from the admin page"
        ]
      },
      "acceptanceCriteria": [
        "getAllActiveOrders excludes orders with status #rejected (in addition to already excluding #delivered and #cancelled).",
        "After an order transitions to #rejected (by any mechanism), it stops appearing in the Live Orders list on the next poll/refetch."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the admin UI to remove restaurant-rejected orders from admin pages without affecting non-admin pages (customer/restaurant views). Specifically, the Admin Dashboard “All Orders” list should not render orders with status Rejected.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-2",
          "recent-3"
        ],
        "quotes": [
          "only admin page",
          "do now"
        ]
      },
      "acceptanceCriteria": [
        "In AdminDashboard, the data rendered under the “All Orders” tab does not include orders whose status is Rejected.",
        "Rejecting an order from the admin UI results in it disappearing from the admin UI immediately after mutation success (via existing React Query invalidation/refetch).",
        "No user-facing text is changed to a non-English language (keep all UI messages in English)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (do not introduce additional backend services).",
    "Do not modify files under frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*."
  ],
  "nonGoals": [
    "Implementing a separate restaurant-authenticated dashboard or role model distinct from admin.",
    "Adding real-time/WebSocket updates (continue using existing polling/React Query refetching).",
    "Deleting rejected orders from customer order history (unless they were admin-rejected and thus deleted globally by design)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}