{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Hide rejected orders from Admin Dashboard lists",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Filter out orders with status Rejected from admin-only order lists (especially Admin Dashboard “All Orders”) without changing customer/restaurant pages.",
      "acceptanceCriteria": [
        "In AdminDashboard, the data rendered under the “All Orders” tab does not include orders whose status is Rejected.",
        "Rejecting an order from the admin UI results in it disappearing from the admin UI immediately after mutation success (via existing React Query invalidation/refetch).",
        "No user-facing text is changed to a non-English language (keep all UI messages in English)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Update the Admin Dashboard “All Orders” tab rendering to exclude orders whose status is OrderStatus.rejected (restaurant-rejected) from the list. Keep this filtering scoped to the admin UI only, so customer/restaurant views remain unaffected. Continue relying on existing React Query invalidation in useRejectOrder/useUpdateOrderStatus so the list updates immediately after a successful reject. Use the selected “authorization” component’s role-based access pattern already present (useIsCallerAdmin gating) to ensure this behavior remains admin-only; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/LiveOrdersView.tsx",
          "operation": "modify",
          "description": "Add a defensive UI-side filter to ensure any order with status OrderStatus.rejected is not rendered in the admin Live Orders list if it ever appears due to polling/cache timing. This stays admin-only (component already checks isAdmin) and complements backend filtering/polling behavior. Use the selected “authorization” component’s access-control UI pattern (admin-only screen) as already implemented; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}