{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "SNR Food Court Food Delivery Platform is a single-restaurant food ordering web application built for the Internet Computer. A Motoko canister backend exposes a fixed restaurant profile, a menu catalog (seeded + admin-managed), per-user carts, order placement (with a fixed delivery fee), user order history, and admin order management including a polling-based “live orders” view with status updates. A React + TypeScript SPA frontend authenticates users via Internet Identity, creates an identity-backed canister actor, centralizes backend IO through TanStack React Query hooks, and renders customer/admin UIs using Tailwind + shadcn/ui with Sonner toasts for feedback. Admin access is bootstrapped by calling a canister initialization method with a secret token read from the URL hash/session and compared against a canister environment variable.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication provider",
      "synonyms": [
        "Internet Identity",
        "AuthClient",
        "login/logout",
        "InternetIdentityProvider"
      ],
      "description": "Provides a React context around @dfinity/auth-client to initialize and load persisted identities, perform login against the configured Internet Identity provider, expose detailed login status flags, and logout/clear identity state.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend actor creation tied to identity (anonymous vs authenticated)",
      "synonyms": [
        "useActor",
        "createActorWithConfig",
        "identity-backed actor"
      ],
      "description": "Creates a canister actor keyed by the current principal; uses an anonymous actor when unauthenticated and an identity-backed actor when authenticated, and triggers React Query invalidation/refetch of dependent queries when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Admin bootstrap via secret token + environment variable",
      "synonyms": [
        "_initializeAccessControlWithSecret",
        "CAFFEINE_ADMIN_TOKEN",
        "RBAC bootstrap"
      ],
      "description": "On authenticated actor creation, the frontend passes a secret token to the backend initialization endpoint; the backend compares it to the CAFFEINE_ADMIN_TOKEN env var and assigns the first matching principal as #admin, otherwise registers the principal as #user.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Hash-based secret parameter handling with session persistence",
      "synonyms": [
        "getSecretFromHash",
        "getSecretParameter",
        "sessionStorage",
        "clearParamFromHash"
      ],
      "description": "Utilities to read sensitive values from the URL hash, persist them in sessionStorage for the session, and remove them from the address bar to reduce leakage via history/referers.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Typed React Query hooks for canister API (queries + mutations)",
      "synonyms": [
        "useQueries",
        "TanStack React Query",
        "cache invalidation"
      ],
      "description": "Implements query/mutation hooks for restaurant, menu items, cart, orders, user profiles, live orders polling, and admin checks with cache invalidation and Sonner toast feedback on mutations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Single restaurant profile endpoint",
      "synonyms": [
        "getSingleRestaurant",
        "single-tenant restaurant"
      ],
      "description": "Backend exposes a fixed single restaurant profile (uuid: snr-food-court) used by the frontend for branding and contact details in header/footer and pages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Menu catalog with seeded items and public read APIs",
      "synonyms": [
        "getAllMenuItems",
        "getMenuItem",
        "seeded menu"
      ],
      "description": "Backend maintains a menu item map seeded with initial items and provides APIs to list all menu items and fetch a menu item by UUID; frontend renders menu with images, search, and category filtering.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Admin menu management (add/delete/update menu items)",
      "synonyms": [
        "addMenuItem",
        "deleteMenuItem",
        "updateMenuItem",
        "menu CRUD"
      ],
      "description": "Admin-only endpoints to add/delete/update menu items; the Admin Dashboard UI supports adding and deleting menu items and groups them by category for browsing.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Menu browsing UI with search, category filter, availability overlay, and image fallbacks",
      "synonyms": [
        "HomePage",
        "search",
        "category filter",
        "availability badge"
      ],
      "description": "Frontend shows the restaurant menu with a hero search input, category filter dropdown, category-grouped sections, item cards with availability overlays, mapped images for known items, and rotating fallback images for others.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Required menu item injection on the frontend",
      "synonyms": [
        "REQUIRED_MENU_ITEMS",
        "ensureRequiredMenuItems"
      ],
      "description": "Ensures certain menu items always appear in the UI by merging a required list into fetched menu data when missing from backend responses.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Per-user cart management (add/remove/list/clear)",
      "synonyms": [
        "getCartItems",
        "addToCart",
        "removeFromCart",
        "clearCart"
      ],
      "description": "Backend stores carts per principal and supports adding/removing/listing/clearing cart items (user role required). Frontend displays cart contents, removal actions, and a cart count badge in the header.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Checkout and order placement with fixed delivery fee",
      "synonyms": [
        "placeOrder",
        "DELIVERY_FEE",
        "FIXED_DELIVERY_FEE"
      ],
      "description": "Cart page collects customer name/phone/address and optional notes, computes totals including a fixed ₹25 delivery fee, places an order, clears the cart on success, and navigates the user to their orders list.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Order history for users with status badges/icons",
      "synonyms": [
        "OrdersPage",
        "getUserOrders",
        "order status UI"
      ],
      "description": "Frontend lists the authenticated user’s orders sorted by newest first, displaying totals, delivery address, optional notes, and status labels/icons (pending/preparing/out for delivery/delivered/cancelled).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Admin dashboard with RBAC gating and order management",
      "synonyms": [
        "AdminDashboard",
        "Access Denied",
        "getAllOrders",
        "updateOrderStatus"
      ],
      "description": "Admin Dashboard verifies admin permissions (showing a loading state while verifying) and provides tabs for Live Orders, Menu Items, and All Orders. Admins can update order statuses and cancel orders with confirmation dialogs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Live orders tracking with polling and new-order notifications",
      "synonyms": [
        "LiveOrdersView",
        "getAllActiveOrders",
        "refetchInterval",
        "new order toast"
      ],
      "description": "Backend maintains a liveOrders list and exposes an admin-only query returning active (non-delivered/non-cancelled) orders. Frontend polls every 5 seconds (including background), allows status updates/cancellation, formats timestamps, and shows toasts only for newly appearing orders after the first load.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "User profile persistence and forced onboarding modal",
      "synonyms": [
        "FoodCourtProfile",
        "getCallerUserProfile",
        "saveCallerUserProfile",
        "ProfileSetupModal"
      ],
      "description": "Backend stores a per-user profile (name/email/phone/address). Frontend forces first-time authenticated users to complete a profile modal and uses it to prefill checkout fields.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "RBAC helper endpoints for role query and assignment",
      "synonyms": [
        "getCallerUserRole",
        "assignCallerUserRole",
        "isCallerAdmin"
      ],
      "description": "Backend exposes endpoints to query the caller’s role, check admin status, and assign roles to principals (admin-only assignment). Frontend uses isCallerAdmin to gate admin-only behavior and polling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Admin navigation entry always visible for authenticated users",
      "synonyms": [
        "Header Admin link",
        "admin nav entry"
      ],
      "description": "Header renders an “Admin” navigation entry on desktop and mobile for all authenticated users; selecting it navigates to the Admin Dashboard where non-admins see an explicit “Access Denied” state rather than hiding the entry.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Admin status query hardening with user-facing error toast",
      "synonyms": [
        "useIsCallerAdmin error handling",
        "admin verification toast"
      ],
      "description": "If the admin-status check fails (query error), the UI still renders the “Admin” navigation entry for authenticated users and shows a toast indicating admin status could not be verified; AdminDashboard handles the actual access gating.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Backend menu helper queries and per-user search history recording",
      "synonyms": [
        "getMenuByCategory",
        "searchMenuByName",
        "filterMenuByPriceRange",
        "addSearchHistory"
      ],
      "description": "Backend provides helper queries for menu filtering/search and an endpoint to append search terms to a per-user search history list (user role required).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Blob-storage maintenance endpoints and cycles top-up integration",
      "synonyms": [
        "_caffeineStorageUpdateGatewayPrincipals",
        "_caffeineStorageBlobsToDelete",
        "_caffeineStorageConfirmBlobDeletion",
        "_caffeineStorageRefillCashier"
      ],
      "description": "Implements storage maintenance endpoints for updating authorized gateway principals via a cashier canister, listing dead blobs for deletion, confirming pruning + triggering GC, and refilling the cashier with cycles (cashier-only).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Themeable UI foundation and global notifications",
      "synonyms": [
        "Tailwind",
        "shadcn/ui",
        "next-themes",
        "Sonner Toaster"
      ],
      "description": "Provides a themeable UI system with Tailwind + shadcn/ui components, light/dark mode via next-themes, and global toast notifications via Sonner.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "State-based SPA navigation (no router)",
      "synonyms": [
        "App.tsx navigation",
        "currentPage state"
      ],
      "description": "App uses local React state to switch between Home, Cart, Orders, and Admin pages under a shared header/footer layout.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-remove-do-not-render-the-ui-element-located-at-xpath-html-1-body-1-div-1-div-1-main-1-div-1-div-1-from-the-page-apply-the-change-only-to-this-selected-element-and-its-subtree-and-do-not-modify-other-parts-of-the-ui",
      "title": "Remove (do not render) the UI element located at XPath `/html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[1]` from the page. Apply the change only to this selected element (and its subtree) and do not modify other parts of the UI.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-remove-do-not-render-the-ui-element-located-at-xpath-html-1-body-1-div-1-div-1-main-1-div-1-div-1-div-2-from-the-page-apply-the-change-only-to-this-selected-element-and-its-subtree-and-do-not-modify-other-parts-of-the-ui",
      "title": "Remove (do not render) the UI element located at XPath `/html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[1]/div[2]` from the page. Apply the change only to this selected element (and its subtree) and do not modify other parts of the UI.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [],
  "architectural_notes": [
    "Internet Computer architecture: Motoko canister (query/shared methods) + React SPA frontend calling via generated actor interface.",
    "Backend composition uses Motoko mixins for RBAC/authorization and for blob-storage maintenance endpoints.",
    "Role-based access control (RBAC): principals are assigned #admin/#user, anonymous callers are treated as #guest; admin is bootstrapped via a secret compared to an env var.",
    "Frontend data layer is centralized in custom hooks built on @tanstack/react-query (query keys, conditional enablement, and mutation-driven cache invalidation).",
    "Frontend authentication uses @dfinity/auth-client via a React context provider; identity is persisted and reloaded on mount.",
    "Admin “live orders” uses polling (refetch interval 5s, including background) rather than push/subscription updates.",
    "Single-tenant constraint: backend hard-codes a single restaurant UUID (snr-food-court) and rejects writes for other restaurant IDs.",
    "UI stack: Tailwind + shadcn/ui components, next-themes for light/dark mode, Sonner for global toast notifications.",
    "Navigation is implemented as local React state in App.tsx (no router/URL-based routing for page state).",
    "Frontend includes URL-hash secret handling utilities that persist secrets in sessionStorage and remove them from the address bar via history.replaceState."
  ],
  "known_issues": [
    "Unauthenticated users still create an anonymous actor; several hooks are enabled whenever an actor exists (e.g., getCartItems/getCallerUserProfile) and will trap with backend \"Unauthorized\" instead of being disabled when logged out.",
    "Backend state (menu items, carts, orders, profiles, RBAC roles, nextOrderId) is not declared as stable; upgrades may lose state unless an external migration/stable strategy is added.",
    "Backend addToCart always appends new line items; repeated adds can create duplicates instead of merging/incrementing quantity.",
    "Backend updateCartItems sets price = 0 for newly added/updated items (explicit \"to be implemented\"), which can break totals if used.",
    "Backend markOrderAsDelivered updates the order map but does not actually update the liveOrders list (creates an unused updatedLiveOrder).",
    "Blob-storage cashier principal env var name is \"CAFFFEINE_STORAGE_CASHIER_PRINCIPAL\" (triple 'F'), which is easy to misconfigure and will trap if missing.",
    "_caffeineStorageUpdateGatewayPrincipals has no authorization check; any caller can refresh the authorized gateway principal list (may be intentional but is notable).",
    "frontend/src/pages/RestaurantPage.tsx is empty (placeholder/incomplete) while other pages implement the main UX.",
    "HomePage image map includes a likely typo key ('veg_manuhair') which doesn’t match backend UUID ('veg-manuhair'), so the intended image mapping may not apply.",
    "Two CSS entry files exist (frontend/index.css and frontend/src/index.css) with different design tokens; depending on build/imports this can cause theme inconsistencies."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "SNR Food Court Food Delivery Platform",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}