{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 6,
  "summary": "SNR Food Court Food Delivery Platform is a single-restaurant food ordering web app built for the Internet Computer. A Motoko canister backend exposes a fixed restaurant profile, a menu catalog (seeded + admin-managed), per-user carts, order placement with a fixed delivery fee, per-user order history, and an admin “live orders” view with status updates. A React + TypeScript SPA frontend authenticates users via Internet Identity, creates an identity-backed canister actor, centralizes backend access through TanStack React Query hooks, and provides customer and admin UIs using Tailwind/Shadcn UI with Sonner toasts for feedback. Admin access is bootstrapped by calling a canister initialization method with a secret token read from the URL hash and compared against a canister environment variable.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication provider",
      "synonyms": [
        "Internet Identity",
        "AuthClient",
        "login/logout",
        "InternetIdentityProvider"
      ],
      "description": "Provides a React context around @dfinity/auth-client to initialize/load persisted identities, perform login against the configured II provider, expose detailed login status flags, and logout/clear identity state.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend actor creation with identity switching and access-control initialization",
      "synonyms": [
        "useActor",
        "createActorWithConfig",
        "identity-backed actor",
        "_initializeAccessControlWithSecret"
      ],
      "description": "Creates and caches a canister actor keyed by the current principal. Uses an anonymous actor when unauthenticated and an identity-backed actor when authenticated; on authenticated actor creation it calls the backend RBAC initialization method with a secret token from the URL hash/session.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Admin bootstrap via secret token and environment variable",
      "synonyms": [
        "CAFFEINE_ADMIN_TOKEN",
        "RBAC bootstrap",
        "first admin assignment"
      ],
      "description": "Backend RBAC can be initialized by comparing a user-provided secret to the CAFFEINE_ADMIN_TOKEN environment variable; the first matching caller is assigned #admin, otherwise new callers become #user.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Secure secret extraction from URL hash with session persistence",
      "synonyms": [
        "getSecretFromHash",
        "getSecretParameter",
        "sessionStorage",
        "clearParamFromHash"
      ],
      "description": "Utilities to extract sensitive parameters from the URL hash, persist them in sessionStorage for the session, and remove the secret from the URL using history.replaceState to reduce leakage.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Typed React Query hooks for canister API (queries and mutations)",
      "synonyms": [
        "useQueries",
        "TanStack React Query",
        "cache invalidation"
      ],
      "description": "Implements query/mutation hooks for restaurant info, menu items, cart, orders, user profiles, and admin checks. Mutations invalidate the appropriate caches and show success/error toasts via Sonner.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Single restaurant profile API",
      "synonyms": [
        "getSingleRestaurant",
        "single-tenant restaurant"
      ],
      "description": "Backend exposes a fixed restaurant profile (uuid: snr-food-court) which the frontend uses for branding and display of address/phone/website details.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Menu catalog: seeded items + public read APIs",
      "synonyms": [
        "menu seed data",
        "getAllMenuItems",
        "getMenuItem"
      ],
      "description": "Backend maintains a menu items map seeded with initial items and exposes APIs to list all menu items and fetch a single item by UUID.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Admin menu item management (add, delete, update)",
      "synonyms": [
        "addMenuItem",
        "deleteMenuItem",
        "updateMenuItem",
        "menu CRUD"
      ],
      "description": "Admin-only endpoints to add/delete/update menu items, with validation that restaurantUuid matches the single-restaurant constraint. Frontend admin dashboard supports adding and deleting items.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Menu browsing UI with search, category filtering, availability overlays, and images",
      "synonyms": [
        "HomePage",
        "search",
        "category filter",
        "availability badge",
        "image fallback"
      ],
      "description": "Frontend renders menu items with a hero search input, category filter, category-grouped sections, item cards with availability overlay, and image selection via UUID mapping with rotating fallbacks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Required menu item injection on the frontend",
      "synonyms": [
        "REQUIRED_MENU_ITEMS",
        "ensureRequiredMenuItems"
      ],
      "description": "Ensures certain menu items always appear by merging a required list into fetched menu data when missing from backend responses.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Per-user cart management (add/remove/list/clear)",
      "synonyms": [
        "getCartItems",
        "addToCart",
        "removeFromCart",
        "clearCart"
      ],
      "description": "Backend stores carts per principal and provides endpoints to add, remove, list, and clear cart items (requires #user). Frontend shows cart counts and provides cart item removal and checkout flow.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Checkout and order placement with fixed delivery fee",
      "synonyms": [
        "placeOrder",
        "DELIVERY_FEE",
        "FIXED_DELIVERY_FEE"
      ],
      "description": "Cart page collects customer name/phone/address and optional notes, computes totals including a fixed ₹25 delivery fee, and places orders via the backend which clears the cart on success.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Unique order ID generation with incremental counter",
      "synonyms": [
        "nextOrderId",
        "order-<n> ids"
      ],
      "description": "Backend generates order IDs using an incrementing counter (order-1, order-2, ...) and timestamps orders using Time.now().",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "User order history UI with status badges/icons",
      "synonyms": [
        "OrdersPage",
        "getUserOrders",
        "status UI"
      ],
      "description": "Frontend displays the caller’s orders sorted by newest first, showing totals, delivery address, optional notes, and a color/icon-coded status label (pending/preparing/out for delivery/delivered/cancelled).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "User profile persistence with forced onboarding modal",
      "synonyms": [
        "FoodCourtProfile",
        "getCallerUserProfile",
        "saveCallerUserProfile",
        "ProfileSetupModal"
      ],
      "description": "Backend stores a per-user profile (name/email/phone/address). Frontend forces authenticated users with no profile to complete a modal; checkout fields are prefilled from the stored profile.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Admin dashboard UI with RBAC gating",
      "synonyms": [
        "AdminDashboard",
        "isCallerAdmin",
        "access denied UI"
      ],
      "description": "Admin-only dashboard that verifies admin permissions before showing management tabs; non-admin users see an access denied alert.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Live orders tracking and admin active-orders query",
      "synonyms": [
        "liveOrders",
        "getAllActiveOrders",
        "active-only filtering"
      ],
      "description": "Backend tracks placed orders in a liveOrders list and exposes an admin-only query returning only non-delivered and non-cancelled active orders.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Live orders polling, status updates, cancellation, and new-order notifications",
      "synonyms": [
        "LiveOrdersView",
        "refetchInterval",
        "updateOrderStatus",
        "delta detection"
      ],
      "description": "Admin Live Orders UI polls every 5 seconds (including background), allows status updates/cancellation, resolves item names from the menu list, formats timestamps, and triggers toasts only for newly appearing orders after the initial load.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Admin order management: view all orders and update status",
      "synonyms": [
        "getAllOrders",
        "order status management",
        "cancel order"
      ],
      "description": "Admin endpoints and UI to view all orders including customer details and to update order status. UI includes a cancel flow with confirmation (disabled for delivered/cancelled).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "RBAC helper endpoints (role query and role assignment)",
      "synonyms": [
        "getCallerUserRole",
        "assignCallerUserRole",
        "isCallerAdmin"
      ],
      "description": "Backend exposes endpoints to query the caller’s role, check admin status, and assign roles to principals (admin-only assignment). Frontend uses isCallerAdmin to gate admin UI and enable admin-only polling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Menu helper queries and per-user search history API",
      "synonyms": [
        "getMenuByCategory",
        "searchMenuByName",
        "filterMenuByPriceRange",
        "addSearchHistory"
      ],
      "description": "Backend provides helper queries for category filtering, name search, and price-range filtering, plus a per-user endpoint to append search terms to a search history list (requires #user).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Blob storage maintenance mixin and cycle top-up integration",
      "synonyms": [
        "_caffeineStorageUpdateGatewayPrincipals",
        "_caffeineStorageBlobsToDelete",
        "_caffeineStorageConfirmBlobDeletion",
        "_caffeineStorageRefillCashier"
      ],
      "description": "Implements storage maintenance endpoints: refresh authorized gateway principals from a cashier canister, check blob liveness, list dead blobs for deletion, confirm pruning + trigger GC, and refill/top-up the cashier with cycles (cashier-only).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Responsive navigation with cart indicator and conditional admin entry",
      "synonyms": [
        "Header",
        "mobile drawer menu",
        "cart badge",
        "Admin link gating"
      ],
      "description": "Header provides desktop navigation and a mobile sheet/drawer. Cart button shows a count badge, Orders/Cart appear only when authenticated, and Admin appears only for admins.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Themeable UI foundation and global notifications",
      "synonyms": [
        "Tailwind",
        "Shadcn UI",
        "next-themes",
        "Sonner Toaster"
      ],
      "description": "Global UI foundation includes Tailwind + Shadcn UI components, light/dark mode support via next-themes, and a global Sonner toaster for app-wide notifications.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "State-based SPA page navigation (no router)",
      "synonyms": [
        "currentPage state",
        "App.tsx navigation"
      ],
      "description": "App uses local React state to switch between Home, Cart, Orders, and Admin views under a shared Header/Footer layout.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Canister migration scaffold for upgrade compatibility",
      "synonyms": [
        "migration.mo",
        "with migration = Migration.run"
      ],
      "description": "Backend includes a migration module and uses the Motoko migration hook pattern to support state evolution across upgrades (currently initializes a nextOrderId field in the migration schema).",
      "reqIds": [],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add payment method choice at checkout (Online vs Cash on Delivery) and persist/display it in order details for customer + owner/admin views.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add an optional passcode gate before showing the Admin Dashboard (requested passcode: 8008448244), in addition to existing Internet Identity/RBAC admin access.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Internet Computer architecture: Motoko canister (query/shared methods) + React SPA frontend calling via generated actor.",
    "Backend code composition uses Motoko mixins (authorization/RBAC mixin and blob-storage maintenance mixin).",
    "Role-based access control (RBAC): principals are assigned #admin or #user; anonymous callers are treated as #guest; admin is bootstrapped via a secret compared to an env var.",
    "Frontend data layer is centralized in custom hooks built on @tanstack/react-query (keyed caching, conditional enabling, mutation-driven invalidation).",
    "Admin live orders view uses polling (React Query refetchInterval=5000, background refetch enabled) rather than push updates.",
    "Single-tenant constraint: backend enforces a single hard-coded restaurant UUID (snr-food-court) for menu/cart/order writes.",
    "UI stack: Tailwind + Shadcn UI components, next-themes for light/dark mode, Sonner for toast notifications.",
    "Navigation is implemented as local React state in App.tsx (no router/URLs for page state)."
  ],
  "known_issues": [
    "frontend/src/pages/RestaurantPage.tsx is empty, indicating an unused or incomplete page.",
    "Several frontend queries run against an anonymous actor when logged out (e.g., getCallerUserProfile/getCartItems) and can trap with backend \"Unauthorized\"; hooks are enabled based on actor presence, but the actor is always created (anonymous when unauthenticated).",
    "Backend addToCart appends line-items without merging by menuItemUuid; repeated adds can create duplicate cart lines instead of incrementing quantity.",
    "Backend updateCartItems sets price = 0 for newly added/updated items (explicit \"to be implemented\"), which can break totals if that endpoint is used.",
    "Backend markOrderAsDelivered updates the orders map but does not actually update the liveOrders list (creates an unused updatedLiveOrder).",
    "Potential canister upgrade persistence issue: nextOrderId is declared as a normal var in main.mo while a migration scaffold exists; without a stable binding, order IDs may reset after upgrade depending on the migration framework behavior.",
    "Blob storage env var name is \"CAFFFEINE_STORAGE_CASHIER_PRINCIPAL\" (triple 'F'); this is easy to misconfigure and will trap at runtime if missing.",
    "_caffeineStorageUpdateGatewayPrincipals has no authorization check; any caller can refresh the authorized gateway principal list (may be intentional but is notable).",
    "HomePage menuItemImageMap includes a likely typo key ('veg_manuhair') that does not match backend uuid ('veg-manuhair'), so the intended image mapping may not apply.",
    "Two different global CSS files exist (frontend/index.css and frontend/src/index.css) with different design tokens; depending on bundling/imports, themes can be inconsistent."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "SNR Food Court Food Delivery Platform",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}